# CreatePullDownSearch

## Description
Creates a pulldown menu with a search bar at the top.&lt;BR&gt;
&lt;BR&gt;
The contents of the pulldown should be filtered as you type in the search bar.&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE CreatePullDownSearch(
				nDialogID     : LONGINT;
				nComponentID  : LONGINT;
				nWidthInChars : INTEGER);
```

```python

def vs.CreatePullDownSearch(nDialogID, nComponentID, nWidthInChars):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT||
|nComponentID|LONGINT||
|nWidthInChars|INTEGER||

## Version
Availability: from Vectorworks 2020
## Category
* Dialogs - Modern